# Development-focused Brewfile
# Core development tools and utilities for software development

# Essential CLI tools for development
brew "bat"                    # Better cat with syntax highlighting
brew "eza"                    # Modern ls replacement  
brew "fd"                     # Better find
brew "fzf"                    # Fuzzy finder
brew "ripgrep"                # Better grep
brew "zoxide"                 # Smart cd command
brew "curlie"                 # Modern curl with better syntax
brew "trash"                  # Safe file deletion to trash

# Git and version control
brew "gh"                     # GitHub CLI

# Programming languages and runtimes
brew "node"                   # Node.js for JavaScript/TypeScript
brew "go"                     # Go programming language
brew "python@3.11"            # Python 3.11

# Development utilities
brew "tree"                   # Directory tree viewer
brew "htop"                   # Better process viewer
brew "bottom"                 # Modern system monitor
brew "procs"                  # Modern process viewer
brew "tldr"                   # Simplified man pages
brew "jq"                     # JSON processor
brew "yq"                     # YAML/JSON/XML processor
brew "rsync"                  # File synchronization tool

# Package managers and development tools
brew "composer"               # PHP dependency manager
brew "pipenv"                 # Python dependency management

# Database and migration tools
brew "golang-migrate"         # Database migrations
brew "pgcli"                  # Enhanced PostgreSQL CLI
brew "mycli"                  # Enhanced MySQL CLI

# Code quality and utilities
brew "jsonlint"              # JSON validator
brew "shellcheck"            # Shell script linter
brew "wget"                  # Download utility
brew "coreutils"             # GNU core utilities

# Additional development utilities
brew "watch"                 # Execute commands periodically
brew "git-delta"             # Better git diff viewer
